; ModuleID = 'wrapper.3993989137375699-cgu.0'
source_filename = "wrapper.3993989137375699-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"bindings::bindings_raw::authenticate_message" = type <{ [8 x i8], i32, %"bindings::bindings_raw::security_buffer", %"bindings::bindings_raw::security_buffer", %"bindings::bindings_raw::security_buffer", %"bindings::bindings_raw::security_buffer", %"bindings::bindings_raw::security_buffer", %"bindings::bindings_raw::security_buffer", i32, %"bindings::bindings_raw::__IncompleteArrayField<i8>" }>
%"bindings::bindings_raw::security_buffer" = type <{ i16, i16, i32 }>
%"bindings::bindings_raw::__IncompleteArrayField<i8>" = type { %"core::marker::PhantomData<i8>", [0 x i8] }
%"core::marker::PhantomData<i8>" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<core::alloc::AllocError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::AllocError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !15, identifier: "247c22649f48f93823d8ae80f7e271ca")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !13, file: !2, align: 8, elements: !15, identifier: "5849e4970cc6e329e27571522303204")
!13 = !DINamespace(name: "alloc", scope: !14)
!14 = !DINamespace(name: "core", scope: null)
!15 = !{}
!16 = !{i32 1, !"Code Model", i32 2}
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !20, producer: "clang LLVM (rustc version 1.71.0 (8ede3aae2 2023-07-12))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, globals: !105, splitDebugInlining: false)
!20 = !DIFile(filename: "fs/ksmbd/wrapper.rs/@/wrapper.3993989137375699-cgu.0", directory: "/home/ubuntu/Desktop/workspace/kernel/buildroot/output/build/linux-rust")
!21 = !{!22, !91, !100}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !23, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagEnumClass, elements: !26)
!23 = !DINamespace(name: "alignment", scope: !24)
!24 = !DINamespace(name: "ptr", scope: !14)
!25 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!27 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!31 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!32 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!33 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!34 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!35 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!36 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!37 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!38 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!39 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!40 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!41 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!42 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!43 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!44 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!45 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!46 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!47 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!48 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!49 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!50 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!51 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!52 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!53 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!54 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!55 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!56 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!57 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!58 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!59 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!60 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!61 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!62 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!63 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!64 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!65 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!66 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!67 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!83 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!84 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!85 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!86 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!87 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!88 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!89 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!90 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !92, file: !2, baseType: !94, size: 8, align: 8, flags: DIFlagEnumClass, elements: !95)
!92 = !DINamespace(name: "rt", scope: !93)
!93 = !DINamespace(name: "fmt", scope: !14)
!94 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!95 = !{!96, !97, !98, !99}
!96 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !101, file: !2, baseType: !94, size: 8, align: 8, flags: DIFlagEnumClass, elements: !102)
!101 = !DINamespace(name: "ffi", scope: !14)
!102 = !{!103, !104}
!103 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!105 = !{!0}
!106 = distinct !DISubprogram(name: "drop_in_place<core::alloc::AllocError>", linkageName: "_RINvNtCsgh59pMgT09I_4core3ptr13drop_in_placeNtNtB4_5alloc10AllocErrorECs4WtFLvQmBW7_7wrapper", scope: !24, file: !107, line: 497, type: !108, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !113, retainedNodes: !111)
!107 = !DIFile(filename: "/home/ubuntu/.rustup/toolchains/1.71.0-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e73cb9386378d35e1df544cb9e8dd07b")
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::alloc::AllocError", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!111 = !{!112}
!112 = !DILocalVariable(arg: 1, scope: !106, file: !107, line: 497, type: !110)
!113 = !{!114}
!114 = !DITemplateTypeParameter(name: "T", type: !12)
!115 = !DILocation(line: 0, scope: !106)
!116 = !DILocation(line: 497, column: 1, scope: !106)
!117 = distinct !DISubprogram(name: "fmt", linkageName: "_RNvXs1l_NtNtCsgh59pMgT09I_4core3fmt3numtNtB8_5Debug3fmt", scope: !119, file: !118, line: 189, type: !121, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !15, retainedNodes: !178)
!118 = !DIFile(filename: "/home/ubuntu/.rustup/toolchains/1.71.0-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "3143de71d5ad70ee2e53269932cc8053")
!119 = !DINamespace(name: "{impl#85}", scope: !120)
!120 = !DINamespace(name: "num", scope: !93)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !141, !143}
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !124, file: !2, size: 8, align: 8, elements: !125, templateParams: !15, identifier: "b2c2b7423c5c11b8ce8c7d2c658bb1a7")
!124 = !DINamespace(name: "result", scope: !14)
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 8, align: 8, elements: !127, templateParams: !15, identifier: "25a883e3e117f640b9aff6229b32c0c7", discriminator: !140)
!127 = !{!128, !136}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !126, file: !2, baseType: !129, size: 8, align: 8, extraData: i64 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !123, file: !2, size: 8, align: 8, elements: !130, templateParams: !132, identifier: "4f9087f25d99523b32692a4434939b12")
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !129, file: !2, baseType: !7, align: 8, offset: 8)
!132 = !{!133, !134}
!133 = !DITemplateTypeParameter(name: "T", type: !7)
!134 = !DITemplateTypeParameter(name: "E", type: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !93, file: !2, align: 8, elements: !15, identifier: "544061a18c518a4c373f42404ea83d9")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !126, file: !2, baseType: !137, size: 8, align: 8, extraData: i64 1)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !123, file: !2, size: 8, align: 8, elements: !138, templateParams: !132, identifier: "24e123df92b9cd1340ef4ecd62abe41e")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !2, baseType: !135, align: 8, offset: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !94, size: 8, align: 8, flags: DIFlagArtificial)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !93, file: !2, size: 512, align: 64, elements: !145, templateParams: !15, identifier: "ef8740bbc2e13c0393d131026881f88d")
!145 = !{!146, !148, !150, !151, !166, !167}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !2, baseType: !147, size: 32, align: 32, offset: 416)
!147 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !144, file: !2, baseType: !149, size: 32, align: 32, offset: 384)
!149 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !144, file: !2, baseType: !91, size: 8, align: 8, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !144, file: !2, baseType: !152, size: 128, align: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !153, file: !2, size: 128, align: 64, elements: !154, templateParams: !15, identifier: "cc7a036b3966298f41650d1e3bfcf99")
!153 = !DINamespace(name: "option", scope: !14)
!154 = !{!155}
!155 = !DICompositeType(tag: DW_TAG_variant_part, scope: !152, file: !2, size: 128, align: 64, elements: !156, templateParams: !15, identifier: "5175d08677736b188ac49e308460be2f", discriminator: !165)
!156 = !{!157, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !155, file: !2, baseType: !158, size: 128, align: 64, extraData: i64 0)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !152, file: !2, size: 128, align: 64, elements: !15, templateParams: !159, identifier: "2c185adc5e077ff7d0d9a78d39e55e")
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "T", type: !9)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !155, file: !2, baseType: !162, size: 128, align: 64, extraData: i64 1)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !152, file: !2, size: 128, align: 64, elements: !163, templateParams: !159, identifier: "6d52533b9790bdf911e11bf13994434c")
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !162, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagArtificial)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !144, file: !2, baseType: !152, size: 128, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !144, file: !2, baseType: !168, size: 128, align: 64, offset: 256)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !169, templateParams: !15, identifier: "d82babc35bec8bd6b00be6d16fdfb6a8")
!169 = !{!170, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !168, file: !2, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64, dwarfAddressSpace: 0)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !15, identifier: "aafebaa022c27b93cf6097cb11dd5fc")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !168, file: !2, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 3, lowerBound: 0)
!178 = !{!179, !180}
!179 = !DILocalVariable(name: "self", arg: 1, scope: !117, file: !118, line: 189, type: !141)
!180 = !DILocalVariable(name: "f", arg: 2, scope: !117, file: !118, line: 189, type: !143)
!181 = !DILocation(line: 0, scope: !117)
!182 = !DILocation(line: 190, column: 20, scope: !117)
!183 = !DILocation(line: 192, column: 27, scope: !117)
!184 = !DILocation(line: 191, column: 21, scope: !117)
!185 = !DILocation(line: 197, column: 14, scope: !117)
!186 = !DILocation(line: 195, column: 21, scope: !117)
!187 = !DILocation(line: 193, column: 21, scope: !117)
!188 = distinct !DISubprogram(name: "fmt<bindings::bindings_raw::ntlmv2_resp>", linkageName: "_RNvXsl_NtCsgh59pMgT09I_4core3fmtONtNtCs68AuNRdv55k_8bindings12bindings_raw11ntlmv2_respNtB5_5Debug3fmtCs4WtFLvQmBW7_7wrapper", scope: !190, file: !189, line: 2440, type: !191, scopeLine: 2440, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !212, retainedNodes: !209)
!189 = !DIFile(filename: "/home/ubuntu/.rustup/toolchains/1.71.0-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a732c99c57cb2d76a548fb6f43c5e00")
!190 = !DINamespace(name: "{impl#23}", scope: !93)
!191 = !DISubroutineType(types: !192)
!192 = !{!123, !193, !143}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*mut bindings::bindings_raw::ntlmv2_resp", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ntlmv2_resp", baseType: !195, size: 64, align: 64, dwarfAddressSpace: 0)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "ntlmv2_resp", scope: !196, file: !2, size: 352, align: 8, elements: !198, templateParams: !15, identifier: "7ab32fa9129a5539cbef4b6de15d867b")
!196 = !DINamespace(name: "bindings_raw", scope: !197)
!197 = !DINamespace(name: "bindings", scope: null)
!198 = !{!199, !204, !205, !206, !207, !208}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ntlmv2_hash", scope: !195, file: !2, baseType: !200, size: 128, align: 8)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 128, align: 8, elements: !202)
!201 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!202 = !{!203}
!203 = !DISubrange(count: 16, lowerBound: 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "blob_signature", scope: !195, file: !2, baseType: !147, size: 32, align: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !195, file: !2, baseType: !147, size: 32, align: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !195, file: !2, baseType: !25, size: 64, align: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "client_chal", scope: !195, file: !2, baseType: !25, size: 64, align: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !195, file: !2, baseType: !147, size: 32, align: 32, offset: 320)
!209 = !{!210, !211}
!210 = !DILocalVariable(name: "self", arg: 1, scope: !188, file: !189, line: 2440, type: !193)
!211 = !DILocalVariable(name: "f", arg: 2, scope: !188, file: !189, line: 2440, type: !143)
!212 = !{!213}
!213 = !DITemplateTypeParameter(name: "T", type: !195)
!214 = !DILocalVariable(name: "self", arg: 1, scope: !215, file: !189, line: 2411, type: !193)
!215 = distinct !DISubprogram(name: "fmt<bindings::bindings_raw::ntlmv2_resp>", linkageName: "_RNvXsh_NtCsgh59pMgT09I_4core3fmtONtNtCs68AuNRdv55k_8bindings12bindings_raw11ntlmv2_respNtB5_7Pointer3fmtCs4WtFLvQmBW7_7wrapper", scope: !216, file: !189, line: 2411, type: !191, scopeLine: 2411, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !212, retainedNodes: !217)
!216 = !DINamespace(name: "{impl#19}", scope: !93)
!217 = !{!214, !218}
!218 = !DILocalVariable(name: "f", arg: 2, scope: !215, file: !189, line: 2411, type: !143)
!219 = !DILocation(line: 0, scope: !215, inlinedAt: !220)
!220 = !DILocation(line: 2441, column: 9, scope: !188)
!221 = !DILocation(line: 0, scope: !188)
!222 = !DILocalVariable(name: "f", arg: 2, scope: !223, file: !189, line: 2371, type: !143)
!223 = distinct !DISubprogram(name: "fmt<bindings::bindings_raw::ntlmv2_resp>", linkageName: "_RNvXsg_NtCsgh59pMgT09I_4core3fmtPNtNtCs68AuNRdv55k_8bindings12bindings_raw11ntlmv2_respNtB5_7Pointer3fmtCs4WtFLvQmBW7_7wrapper", scope: !224, file: !189, line: 2371, type: !225, scopeLine: 2371, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !212, retainedNodes: !229)
!224 = !DINamespace(name: "{impl#18}", scope: !93)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !227, !143}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const bindings::bindings_raw::ntlmv2_resp", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bindings::bindings_raw::ntlmv2_resp", baseType: !195, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !{!230, !222}
!230 = !DILocalVariable(name: "self", arg: 1, scope: !223, file: !189, line: 2371, type: !227)
!231 = !DILocation(line: 0, scope: !223, inlinedAt: !232)
!232 = !DILocation(line: 2412, column: 9, scope: !215, inlinedAt: !220)
!233 = !DILocation(line: 2412, column: 24, scope: !215, inlinedAt: !220)
!234 = !DILocalVariable(name: "self", arg: 1, scope: !235, file: !236, line: 237, type: !6)
!235 = distinct !DISubprogram(name: "expose_addr<()>", linkageName: "_RNvMNtNtCsgh59pMgT09I_4core3ptr9const_ptrPu11expose_addrCs4WtFLvQmBW7_7wrapper", scope: !237, file: !236, line: 237, type: !239, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !242, retainedNodes: !241)
!236 = !DIFile(filename: "/home/ubuntu/.rustup/toolchains/1.71.0-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "27317801281f9da12deb060af5b3e36e")
!237 = !DINamespace(name: "{impl#0}", scope: !238)
!238 = !DINamespace(name: "const_ptr", scope: !24)
!239 = !DISubroutineType(types: !240)
!240 = !{!9, !6}
!241 = !{!234}
!242 = !{!133}
!243 = !DILocation(line: 0, scope: !235, inlinedAt: !244)
!244 = !DILocation(line: 2373, column: 48, scope: !223, inlinedAt: !232)
!245 = !DILocation(line: 239, column: 9, scope: !235, inlinedAt: !244)
!246 = !DILocation(line: 2373, column: 9, scope: !223, inlinedAt: !232)
!247 = !DILocation(line: 2442, column: 6, scope: !188)
!248 = distinct !DISubprogram(name: "rust_ksmbd_decode_ntlmssp_auth_blob", scope: !250, file: !249, line: 66, type: !251, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, templateParams: !15, retainedNodes: !16616)
!249 = !DIFile(filename: "fs/ksmbd/wrapper.rs", directory: "/home/ubuntu/Desktop/workspace/kernel/buildroot/output/build/linux-rust", checksumkind: CSK_MD5, checksum: "6d83da05f17801af5fa9b3ae39caaac4")
!250 = !DINamespace(name: "wrapper", scope: null)
!251 = !DISubroutineType(types: !252)
!252 = !{!253, !254, !253, !286, !341}
!253 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::authenticate_message", baseType: !255, size: 64, align: 64, dwarfAddressSpace: 0)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "authenticate_message", scope: !196, file: !2, size: 512, align: 8, elements: !256, templateParams: !15, identifier: "c0380c4a0ea9be22b6444855214b5d8b")
!256 = !{!257, !261, !262, !268, !269, !270, !271, !272, !273, !274}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !255, file: !2, baseType: !258, size: 64, align: 8)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, align: 8, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 8, lowerBound: 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "MessageType", scope: !255, file: !2, baseType: !147, size: 32, align: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "LmChallengeResponse", scope: !255, file: !2, baseType: !263, size: 64, align: 8, offset: 96)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "security_buffer", scope: !196, file: !2, size: 64, align: 8, elements: !264, templateParams: !15, identifier: "85919d5ff4d0d6eaf53efa16eaaf6f39")
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !263, file: !2, baseType: !142, size: 16, align: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumLength", scope: !263, file: !2, baseType: !142, size: 16, align: 16, offset: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "BufferOffset", scope: !263, file: !2, baseType: !147, size: 32, align: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "NtChallengeResponse", scope: !255, file: !2, baseType: !263, size: 64, align: 8, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "DomainName", scope: !255, file: !2, baseType: !263, size: 64, align: 8, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "UserName", scope: !255, file: !2, baseType: !263, size: 64, align: 8, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "WorkstationName", scope: !255, file: !2, baseType: !263, size: 64, align: 8, offset: 352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "SessionKey", scope: !255, file: !2, baseType: !263, size: 64, align: 8, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiateFlags", scope: !255, file: !2, baseType: !147, size: 32, align: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "UserString", scope: !255, file: !2, baseType: !275, align: 8, offset: 512)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "__IncompleteArrayField<i8>", scope: !196, file: !2, align: 8, elements: !276, templateParams: !280, identifier: "e5312c3e6f76765d41d4ad08dc47c9ae")
!276 = !{!277, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !275, file: !2, baseType: !278, align: 8)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<i8>", scope: !279, file: !2, align: 8, elements: !15, templateParams: !280, identifier: "ee60210e34e47a88a55716306eadfba7")
!279 = !DINamespace(name: "marker", scope: !14)
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !201)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !275, file: !2, baseType: !283, align: 8)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, align: 8, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 0, lowerBound: 0)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ksmbd_conn", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_conn", scope: !196, file: !2, size: 4608, align: 64, elements: !288, templateParams: !15, identifier: "ad83a7e9b0523e1f861bd82672b77bd4")
!288 = !{!289, !320, !1172, !1177, !1178, !1185, !1186, !1187, !1188, !16464, !16508, !16524, !16525, !16526, !16527, !16528, !16529, !16530, !16531, !16532, !16533, !16534, !16535, !16536, !16537, !16538, !16543, !16544, !16552, !16553, !16554, !16561, !16562, !16563, !16564, !16565, !16566, !16567, !16568, !16569, !16570, !16592, !16593, !16609, !16610, !16611, !16612, !16613, !16614, !16615}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !287, file: !2, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::smb_version_values", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "smb_version_values", scope: !196, file: !2, size: 1088, align: 64, elements: !292, templateParams: !15, identifier: "6528459ef28953af85617f034962377c")
!292 = !{!293, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "version_string", scope: !291, file: !2, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_id", scope: !291, file: !2, baseType: !142, size: 16, align: 16, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lock_cmd", scope: !291, file: !2, baseType: !142, size: 16, align: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "max_read_size", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "max_write_size", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "max_trans_size", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "max_credits", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "large_lock_type", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive_lock_type", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "shared_lock_type", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "unlock_lock_type", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_header_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "read_rsp_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cap_unix", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cap_nt_find", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 608)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cap_large_files", scope: !291, file: !2, baseType: !147, size: 32, align: 32, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "signing_enabled", scope: !291, file: !2, baseType: !142, size: 16, align: 16, offset: 672)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "signing_required", scope: !291, file: !2, baseType: !142, size: 16, align: 16, offset: 688)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "create_lease_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "create_durable_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "create_durable_v2_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "create_mxac_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "create_disk_id_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "create_posix_size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !287, file: !2, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::smb_version_ops", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "smb_version_ops", scope: !196, file: !2, size: 960, align: 64, elements: !323, templateParams: !15, identifier: "43beeff93b3b410fd01573f8773055bd")
!323 = !{!324, !1046, !1063, !1080, !1081, !1082, !1083, !1084, !1101, !1102, !1119, !1136, !1153, !1170, !1171}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmd_val", scope: !322, file: !2, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut bindings::bindings_raw::ksmbd_work) -> u16>", scope: !153, file: !2, size: 64, align: 64, elements: !326, templateParams: !15, identifier: "74a6b9208199fb04b1a7e77d57444a2")
!326 = !{!327}
!327 = !DICompositeType(tag: DW_TAG_variant_part, scope: !325, file: !2, size: 64, align: 64, elements: !328, templateParams: !15, identifier: "77e5aff402c0eca2d2b6d21ebeccd0e2", discriminator: !1045)
!328 = !{!329, !1041}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !327, file: !2, baseType: !330, size: 64, align: 64, extraData: i64 0)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !325, file: !2, size: 64, align: 64, elements: !15, templateParams: !331, identifier: "a9877b622e9dfebd1a927080fac4269b")
!331 = !{!332}
!332 = !DITemplateTypeParameter(name: "T", type: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut bindings::bindings_raw::ksmbd_work) -> u16", baseType: !334, size: 64, align: 64, dwarfAddressSpace: 0)
!334 = !DISubroutineType(types: !335)
!335 = !{!142, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ksmbd_work", baseType: !337, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_work", scope: !196, file: !2, size: 1920, align: 64, elements: !338, templateParams: !15, identifier: "3309bca4a02f4ddbc909fe8e67aab135")
!338 = !{!339, !340, !449, !470, !471, !472, !473, !474, !475, !476, !477, !478, !998, !999, !1000, !1001, !1002, !1003, !1004, !1015, !1016, !1017, !1019, !1036, !1037, !1038, !1039, !1040}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !337, file: !2, baseType: !286, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sess", scope: !337, file: !2, baseType: !341, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ksmbd_session", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_session", scope: !196, file: !2, size: 2240, align: 64, elements: !343, templateParams: !15, identifier: "234b8095fa77bdd3d65f965341fffbe3")
!343 = !{!344, !345, !346, !347, !358, !359, !360, !362, !363, !364, !365, !367, !371, !378, !388, !389, !393, !394, !398, !399, !401}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !342, file: !2, baseType: !25, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dialect", scope: !342, file: !2, baseType: !142, size: 16, align: 16, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ClientGUID", scope: !342, file: !2, baseType: !200, size: 128, align: 8, offset: 80)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !342, file: !2, baseType: !348, size: 64, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ksmbd_user", baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_user", scope: !196, file: !2, size: 384, align: 64, elements: !350, templateParams: !15, identifier: "c0fde510f9c18520702f8cccc98418f0")
!350 = !{!351, !352, !353, !354, !355, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !349, file: !2, baseType: !142, size: 16, align: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !349, file: !2, baseType: !147, size: 32, align: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !349, file: !2, baseType: !147, size: 32, align: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !2, baseType: !294, size: 64, align: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "passkey_sz", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "passkey", scope: !349, file: !2, baseType: !294, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "failed_login_count", scope: !349, file: !2, baseType: !147, size: 32, align: 32, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_number", scope: !342, file: !2, baseType: !147, size: 32, align: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !342, file: !2, baseType: !147, size: 32, align: 32, offset: 352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !342, file: !2, baseType: !361, size: 8, align: 8, offset: 384)
!361 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !342, file: !2, baseType: !361, size: 8, align: 8, offset: 392)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "is_anonymous", scope: !342, file: !2, baseType: !361, size: 8, align: 8, offset: 400)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !342, file: !2, baseType: !253, size: 32, align: 32, offset: 416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Preauth_HashValue", scope: !342, file: !2, baseType: !366, size: 64, align: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sess_key", scope: !342, file: !2, baseType: !368, size: 320, align: 8, offset: 512)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 320, align: 8, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 40, lowerBound: 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !342, file: !2, baseType: !372, size: 128, align: 64, offset: 832)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", scope: !196, file: !2, size: 128, align: 64, elements: !373, templateParams: !15, identifier: "2ff4f2d9fd203ed46a3bfaed715f280")
!373 = !{!374, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !2, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::hlist_node", baseType: !372, size: 64, align: 64, dwarfAddressSpace: 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !372, file: !2, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut bindings::bindings_raw::hlist_node", baseType: !375, size: 64, align: 64, dwarfAddressSpace: 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ksmbd_chann_list", scope: !342, file: !2, baseType: !379, size: 128, align: 64, offset: 960)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", scope: !196, file: !2, size: 128, align: 64, elements: !380, templateParams: !15, identifier: "34c8e9a995f2f90904fa1839515db3e")
!380 = !{!381, !385, !386}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !379, file: !2, baseType: !382, size: 32, align: 32)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", scope: !196, file: !2, size: 32, align: 32, elements: !383, templateParams: !15, identifier: "da6b1f76873a1d94d9fe1444e94b7e1c")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_opaque_blob", scope: !382, file: !2, baseType: !147, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !379, file: !2, baseType: !147, size: 32, align: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !379, file: !2, baseType: !387, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tree_conns", scope: !342, file: !2, baseType: !379, size: 128, align: 64, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tree_conn_ida", scope: !342, file: !2, baseType: !390, size: 128, align: 64, offset: 1216)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ida", scope: !196, file: !2, size: 128, align: 64, elements: !391, templateParams: !15, identifier: "beed5cdb89fb450b85d288386105acee")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "xa", scope: !390, file: !2, baseType: !379, size: 128, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rpc_handle_list", scope: !342, file: !2, baseType: !379, size: 128, align: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "smb3encryptionkey", scope: !342, file: !2, baseType: !395, size: 256, align: 8, offset: 1472)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, align: 8, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 32, lowerBound: 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "smb3decryptionkey", scope: !342, file: !2, baseType: !395, size: 256, align: 8, offset: 1728)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "smb3signingkey", scope: !342, file: !2, baseType: !400, size: 128, align: 8, offset: 1984)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, align: 8, elements: !202)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "file_table", scope: !342, file: !2, baseType: !402, size: 128, align: 64, offset: 2112)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_file_table", scope: !196, file: !2, size: 128, align: 64, elements: !403, templateParams: !15, identifier: "25bf76505b8cb6241d7bb8bb0ac61ea1")
!403 = !{!404, !442}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !402, file: !2, baseType: !405, size: 64, align: 32)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "rwlock_t", scope: !196, file: !2, size: 64, align: 32, elements: !406, templateParams: !15, identifier: "8658957c6d4280f07121bd762469f24d")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !405, file: !2, baseType: !408, size: 64, align: 32)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "qrwlock", scope: !196, file: !2, size: 64, align: 32, elements: !409, templateParams: !15, identifier: "1aa861d815ea71c02e92617ed8359864")
!409 = !{!410, !424}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !408, file: !2, baseType: !411, size: 32, align: 32)
!411 = !DICompositeType(tag: DW_TAG_union_type, name: "qrwlock__bindgen_ty_1", scope: !196, file: !2, size: 32, align: 32, elements: !412, templateParams: !15, identifier: "cd4c5a27f5b8df67496721378a08c340")
!412 = !{!413, !417, !423}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cnts", scope: !411, file: !2, baseType: !414, size: 32, align: 32)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "atomic_t", scope: !196, file: !2, size: 32, align: 32, elements: !415, templateParams: !15, identifier: "4d9bba9d672b6a864cebcdec52eb623f")
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !414, file: !2, baseType: !253, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !411, file: !2, baseType: !418, size: 32, align: 8)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "qrwlock__bindgen_ty_1__bindgen_ty_1", scope: !196, file: !2, size: 32, align: 8, elements: !419, templateParams: !15, identifier: "74c34190be7fca45443fd5f1941a9b85")
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wlocked", scope: !418, file: !2, baseType: !94, size: 8, align: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__lstate", scope: !418, file: !2, baseType: !422, size: 24, align: 8, offset: 8)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 24, align: 8, elements: !176)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !411, file: !2, baseType: !147, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !408, file: !2, baseType: !425, size: 32, align: 32, offset: 32)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", scope: !196, file: !2, size: 32, align: 32, elements: !426, templateParams: !15, identifier: "49445f49735416c6fa2f6b2fa578da60")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !425, file: !2, baseType: !428, size: 32, align: 32)
!428 = !DICompositeType(tag: DW_TAG_union_type, name: "qspinlock__bindgen_ty_1", scope: !196, file: !2, size: 32, align: 32, elements: !429, templateParams: !15, identifier: "498a34d416898190c826736e1d25061b")
!429 = !{!430, !431, !436, !441}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !428, file: !2, baseType: !414, size: 32, align: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !428, file: !2, baseType: !432, size: 16, align: 8)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock__bindgen_ty_1__bindgen_ty_1", scope: !196, file: !2, size: 16, align: 8, elements: !433, templateParams: !15, identifier: "388395434beea5e61eaf2af76ba421db")
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !432, file: !2, baseType: !94, size: 8, align: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !432, file: !2, baseType: !94, size: 8, align: 8, offset: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_2", scope: !428, file: !2, baseType: !437, size: 32, align: 16)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock__bindgen_ty_1__bindgen_ty_2", scope: !196, file: !2, size: 32, align: 16, elements: !438, templateParams: !15, identifier: "206c5c0d655006d36e2191427d569433")
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "locked_pending", scope: !437, file: !2, baseType: !142, size: 16, align: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !437, file: !2, baseType: !142, size: 16, align: 16, offset: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !428, file: !2, baseType: !147, size: 32, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "idr", scope: !402, file: !2, baseType: !443, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::idr", baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "idr", scope: !196, file: !2, size: 192, align: 64, elements: !445, templateParams: !15, identifier: "497fb5a519c7c037b881204ff82c306b")
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !444, file: !2, baseType: !379, size: 128, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !444, file: !2, baseType: !147, size: 32, align: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !444, file: !2, baseType: !147, size: 32, align: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tcon", scope: !337, file: !2, baseType: !450, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ksmbd_tree_connect", baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_tree_connect", scope: !196, file: !2, size: 384, align: 64, elements: !452, templateParams: !15, identifier: "56d54766ad7cc5eefe4a02d893478761")
!452 = !{!453, !454, !455, !461, !462, !468, !469}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !451, file: !2, baseType: !253, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !2, baseType: !147, size: 32, align: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "share_conf", scope: !451, file: !2, baseType: !456, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ksmbd_share_config", baseType: !457, size: 64, align: 64, dwarfAddressSpace: 0)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "ksmbd_share_config", scope: !196, file: !2, align: 8, elements: !458, templateParams: !15, identifier: "43237ec57bbc22f668c48742f3a04ccc")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !457, file: !2, baseType: !460, align: 8)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, align: 8, elements: !284)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !451, file: !2, baseType: !348, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !451, file: !2, baseType: !463, size: 128, align: 64, offset: 192)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", scope: !196, file: !2, size: 128, align: 64, elements: !464, templateParams: !15, identifier: "c81e9f04768e43deba314724f44f5c5f")
!464 = !{!465, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !2, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::list_head", baseType: !463, size: 64, align: 64, dwarfAddressSpace: 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !2, baseType: !466, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "maximal_access", scope: !451, file: !2, baseType: !253, size: 32, align: 32, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "posix_extensions", scope: !451, file: !2, baseType: !361, size: 8, align: 8, offset: 352)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "request_buf", scope: !337, file: !2, baseType: !387, size: 64, align: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "response_buf", scope: !337, file: !2, baseType: !387, size: 64, align: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "aux_payload_buf", scope: !337, file: !2, baseType: !387, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next_smb2_rcv_hdr_off", scope: !337, file: !2, baseType: !253, size: 32, align: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next_smb2_rsp_hdr_off", scope: !337, file: !2, baseType: !253, size: 32, align: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "compound_fid", scope: !337, file: !2, baseType: !25, size: 64, align: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "compound_pfid", scope: !337, file: !2, baseType: !25, size: 64, align: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "compound_sid", scope: !337, file: !2, baseType: !25, size: 64, align: 64, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cred", scope: !337, file: !2, baseType: !479, size: 64, align: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bindings::bindings_raw::cred", baseType: !480, size: 64, align: 64, dwarfAddressSpace: 0)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", scope: !196, file: !2, size: 1344, align: 64, elements: !481, templateParams: !15, identifier: "108d1087fbbe64fffea77f8c192615c2")
!481 = !{!482, !483, !487, !491, !492, !493, !494, !495, !496, !497, !498, !502, !503, !504, !505, !506, !507, !687, !688, !689, !690, !718, !973, !974, !989}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !480, file: !2, baseType: !414, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !480, file: !2, baseType: !484, size: 32, align: 32, offset: 32)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "kuid_t", scope: !196, file: !2, size: 32, align: 32, elements: !485, templateParams: !15, identifier: "9c54e1c9b844956a9dc2f38d6a268ded")
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !484, file: !2, baseType: !147, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !480, file: !2, baseType: !488, size: 32, align: 32, offset: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "kgid_t", scope: !196, file: !2, size: 32, align: 32, elements: !489, templateParams: !15, identifier: "af56ea1e3fafa46b3f172125d4e0a853")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !488, file: !2, baseType: !147, size: 32, align: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "suid", scope: !480, file: !2, baseType: !484, size: 32, align: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sgid", scope: !480, file: !2, baseType: !488, size: 32, align: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "euid", scope: !480, file: !2, baseType: !484, size: 32, align: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "egid", scope: !480, file: !2, baseType: !488, size: 32, align: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fsuid", scope: !480, file: !2, baseType: !484, size: 32, align: 32, offset: 224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fsgid", scope: !480, file: !2, baseType: !488, size: 32, align: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "securebits", scope: !480, file: !2, baseType: !147, size: 32, align: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cap_inheritable", scope: !480, file: !2, baseType: !499, size: 64, align: 64, offset: 320)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_cap_t", scope: !196, file: !2, size: 64, align: 64, elements: !500, templateParams: !15, identifier: "dd3e29427d3134c523d563d156589aa5")
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !499, file: !2, baseType: !25, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cap_permitted", scope: !480, file: !2, baseType: !499, size: 64, align: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cap_effective", scope: !480, file: !2, baseType: !499, size: 64, align: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cap_bset", scope: !480, file: !2, baseType: !499, size: 64, align: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cap_ambient", scope: !480, file: !2, baseType: !499, size: 64, align: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "jit_keyring", scope: !480, file: !2, baseType: !94, size: 8, align: 8, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "session_keyring", scope: !480, file: !2, baseType: !508, size: 64, align: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::key", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", scope: !196, file: !2, size: 1728, align: 64, elements: !510, templateParams: !15, identifier: "6a44af02a1bc5e511b146f105df3e725")
!510 = !{!511, !515, !516, !529, !547, !552, !553, !559, !560, !561, !562, !563, !564, !565, !567, !568, !635, !662}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !509, file: !2, baseType: !512, size: 32, align: 32)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", scope: !196, file: !2, size: 32, align: 32, elements: !513, templateParams: !15, identifier: "b85df1f5c155bf4a648e6c7124240ea6")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !512, file: !2, baseType: !414, size: 32, align: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !509, file: !2, baseType: !253, size: 32, align: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !509, file: !2, baseType: !517, size: 192, align: 64, offset: 64)
!517 = !DICompositeType(tag: DW_TAG_union_type, name: "key__bindgen_ty_1", scope: !196, file: !2, size: 192, align: 64, elements: !518, templateParams: !15, identifier: "9053fb047c53f9a73f8f2b4996ded9c")
!518 = !{!519, !520, !527}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "graveyard_link", scope: !517, file: !2, baseType: !463, size: 128, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "serial_node", scope: !517, file: !2, baseType: !521, size: 192, align: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", scope: !196, file: !2, size: 192, align: 64, elements: !522, templateParams: !15, identifier: "5dd90b4fefa0a2c0d4215158b1c0706c")
!522 = !{!523, !524, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !521, file: !2, baseType: !25, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !521, file: !2, baseType: !525, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::rb_node", baseType: !521, size: 64, align: 64, dwarfAddressSpace: 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !521, file: !2, baseType: !525, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !517, file: !2, baseType: !528, size: 192, align: 64)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, align: 64, elements: !176)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !509, file: !2, baseType: !530, size: 320, align: 64, offset: 256)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", scope: !196, file: !2, size: 320, align: 64, elements: !531, templateParams: !15, identifier: "e89dd13d98512e3b66323810eb75f8b3")
!531 = !{!532, !537, !538, !542, !546}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !530, file: !2, baseType: !533, size: 64, align: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "atomic64_t", scope: !196, file: !2, size: 64, align: 64, elements: !534, templateParams: !15, identifier: "1c1cc0b265e084f4c011d464e31f61fa")
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !533, file: !2, baseType: !536, size: 64, align: 64)
!536 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !530, file: !2, baseType: !533, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !530, file: !2, baseType: !539, size: 32, align: 32, offset: 128)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", scope: !196, file: !2, size: 32, align: 32, elements: !540, templateParams: !15, identifier: "7301206b20b4559d8ae5fafc590fa7b9")
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !539, file: !2, baseType: !414, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !530, file: !2, baseType: !543, size: 32, align: 32, offset: 160)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", scope: !196, file: !2, size: 32, align: 32, elements: !544, templateParams: !15, identifier: "20461e887be05cad10817c462859c2db")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !543, file: !2, baseType: !425, size: 32, align: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !530, file: !2, baseType: !463, size: 128, align: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !509, file: !2, baseType: !548, size: 64, align: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::key_user", baseType: !549, size: 64, align: 64, dwarfAddressSpace: 0)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_user", scope: !196, file: !2, size: 8, align: 8, elements: !550, templateParams: !15, identifier: "720d1ef6bc5abd1d162cfbeafb60c691")
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_address", scope: !549, file: !2, baseType: !94, size: 8, align: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "security", scope: !509, file: !2, baseType: !387, size: 64, align: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_2", scope: !509, file: !2, baseType: !554, size: 64, align: 64, offset: 704)
!554 = !DICompositeType(tag: DW_TAG_union_type, name: "key__bindgen_ty_2", scope: !196, file: !2, size: 64, align: 64, elements: !555, templateParams: !15, identifier: "c8b3b37278efe812bbcc967c82821359")
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "expiry", scope: !554, file: !2, baseType: !536, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "revoked_at", scope: !554, file: !2, baseType: !536, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !554, file: !2, baseType: !25, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "last_used_at", scope: !509, file: !2, baseType: !536, size: 64, align: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !509, file: !2, baseType: !484, size: 32, align: 32, offset: 832)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !509, file: !2, baseType: !488, size: 32, align: 32, offset: 864)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !509, file: !2, baseType: !147, size: 32, align: 32, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "quotalen", scope: !509, file: !2, baseType: !142, size: 16, align: 16, offset: 928)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !509, file: !2, baseType: !142, size: 16, align: 16, offset: 944)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !2, baseType: !566, size: 16, align: 16, offset: 960)
!566 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !2, baseType: !25, size: 64, align: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_3", scope: !509, file: !2, baseType: !569, size: 320, align: 64, offset: 1088)
!569 = !DICompositeType(tag: DW_TAG_union_type, name: "key__bindgen_ty_3", scope: !196, file: !2, size: 320, align: 64, elements: !570, templateParams: !15, identifier: "bd1b4b4b1bb09c28ad2a15a299ab8ee")
!570 = !{!571, !623, !631}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "index_key", scope: !569, file: !2, baseType: !572, size: 320, align: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "keyring_index_key", scope: !196, file: !2, size: 320, align: 64, elements: !573, templateParams: !15, identifier: "62fca47011beb51d95a20be477869530")
!573 = !{!574, !575, !588, !593, !621}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !572, file: !2, baseType: !25, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !572, file: !2, baseType: !576, size: 64, align: 64, offset: 64)
!576 = !DICompositeType(tag: DW_TAG_union_type, name: "keyring_index_key__bindgen_ty_1", scope: !196, file: !2, size: 64, align: 64, elements: !577, templateParams: !15, identifier: "35e747839bcecd5eea7f8b2aceae8e0f")
!577 = !{!578, !586, !587}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !576, file: !2, baseType: !579, size: 64, align: 16)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "keyring_index_key__bindgen_ty_1__bindgen_ty_1", scope: !196, file: !2, size: 64, align: 16, elements: !580, templateParams: !15, identifier: "fd53a71a8b0414f8bc0b1fe8327534e2")
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "desc_len", scope: !579, file: !2, baseType: !142, size: 16, align: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !579, file: !2, baseType: !583, size: 48, align: 8, offset: 16)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 48, align: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 6, lowerBound: 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !576, file: !2, baseType: !25, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !576, file: !2, baseType: !25, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type_", scope: !572, file: !2, baseType: !589, size: 64, align: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::key_type", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_type", scope: !196, file: !2, align: 8, elements: !591, templateParams: !15, identifier: "9422e9a136556671fe482c374c59f46c")
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !590, file: !2, baseType: !460, align: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "domain_tag", scope: !572, file: !2, baseType: !594, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::key_tag", baseType: !595, size: 64, align: 64, dwarfAddressSpace: 0)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_tag", scope: !196, file: !2, size: 192, align: 64, elements: !596, templateParams: !15, identifier: "6da90ec3fc86b31cd7c302910584ea4a")
!596 = !{!597, !619, !620}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !595, file: !2, baseType: !598, size: 128, align: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", scope: !196, file: !2, size: 128, align: 64, elements: !599, templateParams: !15, identifier: "8dd129ab0bb476cd1fb686a9d6f6bfca")
!599 = !{!600, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !2, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::callback_head", baseType: !598, size: 64, align: 64, dwarfAddressSpace: 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !598, file: !2, baseType: !603, size: 64, align: 64, offset: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut bindings::bindings_raw::callback_head)>", scope: !153, file: !2, size: 64, align: 64, elements: !604, templateParams: !15, identifier: "54fdc15fd797b848ad368d1b65a0c144")
!604 = !{!605}
!605 = !DICompositeType(tag: DW_TAG_variant_part, scope: !603, file: !2, size: 64, align: 64, elements: !606, templateParams: !15, identifier: "2cb7b31dad0eafa10d24a343cccbe85", discriminator: !618)
!606 = !{!607, !614}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !605, file: !2, baseType: !608, size: 64, align: 64, extraData: i64 0)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !603, file: !2, size: 64, align: 64, elements: !15, templateParams: !609, identifier: "cb640dab68ff746a61e5eb36c2e767")
!609 = !{!610}
!610 = !DITemplateTypeParameter(name: "T", type: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut bindings::bindings_raw::callback_head)", baseType: !612, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !601}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !605, file: !2, baseType: !615, size: 64, align: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !603, file: !2, size: 64, align: 64, elements: !616, templateParams: !609, identifier: "b7368eeac40081a86b5ef52d45cdb491")
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !615, file: !2, baseType: !611, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, scope: !603, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagArtificial)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !595, file: !2, baseType: !512, size: 32, align: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !595, file: !2, baseType: !361, size: 8, align: 8, offset: 160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !572, file: !2, baseType: !622, size: 64, align: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !569, file: !2, baseType: !624, size: 320, align: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "key__bindgen_ty_3__bindgen_ty_1", scope: !196, file: !2, size: 320, align: 64, elements: !625, templateParams: !15, identifier: "7417aa8bbe36f06d10ad1ac5d378f091")
!625 = !{!626, !627, !628, !629, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !624, file: !2, baseType: !25, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "len_desc", scope: !624, file: !2, baseType: !25, size: 64, align: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "type_", scope: !624, file: !2, baseType: !589, size: 64, align: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "domain_tag", scope: !624, file: !2, baseType: !594, size: 64, align: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !624, file: !2, baseType: !294, size: 64, align: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !569, file: !2, baseType: !632, size: 320, align: 64)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 320, align: 64, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 5, lowerBound: 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_4", scope: !509, file: !2, baseType: !636, size: 256, align: 64, offset: 1408)
!636 = !DICompositeType(tag: DW_TAG_union_type, name: "key__bindgen_ty_4", scope: !196, file: !2, size: 256, align: 64, elements: !637, templateParams: !15, identifier: "745b0922e2d4b8e08dd30dfc1d5a8698")
!637 = !{!638, !648, !661}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !636, file: !2, baseType: !639, size: 256, align: 64)
!639 = !DICompositeType(tag: DW_TAG_union_type, name: "key_payload", scope: !196, file: !2, size: 256, align: 64, elements: !640, templateParams: !15, identifier: "bb672ed315fb861d78c387e6af111d9c")
!640 = !{!641, !642, !646}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_data0", scope: !639, file: !2, baseType: !387, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !639, file: !2, baseType: !643, size: 256, align: 64)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 256, align: 64, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 4, lowerBound: 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !639, file: !2, baseType: !647, size: 256, align: 64)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, align: 64, elements: !644)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !636, file: !2, baseType: !649, size: 256, align: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "key__bindgen_ty_4__bindgen_ty_1", scope: !196, file: !2, size: 256, align: 64, elements: !650, templateParams: !15, identifier: "f1203baeaea9d69130c5f95c6cc520e6")
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "name_link", scope: !649, file: !2, baseType: !463, size: 128, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !649, file: !2, baseType: !653, size: 128, align: 64, offset: 128)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array", scope: !196, file: !2, size: 128, align: 64, elements: !654, templateParams: !15, identifier: "e02b1783cbc66d8d2f3e212cb12c4a5")
!654 = !{!655, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !653, file: !2, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::assoc_array_ptr", baseType: !657, size: 64, align: 64, dwarfAddressSpace: 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_array_ptr", scope: !196, file: !2, size: 8, align: 8, elements: !658, templateParams: !15, identifier: "805d48190212515420aa22e1c9ee4b40")
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_address", scope: !657, file: !2, baseType: !94, size: 8, align: 8)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nr_leaves_on_tree", scope: !653, file: !2, baseType: !25, size: 64, align: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !636, file: !2, baseType: !647, size: 256, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_link", scope: !509, file: !2, baseType: !663, size: 64, align: 64, offset: 1664)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::key_restriction", baseType: !664, size: 64, align: 64, dwarfAddressSpace: 0)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_restriction", scope: !196, file: !2, size: 192, align: 64, elements: !665, templateParams: !15, identifier: "d2eb3df6737567ff5c584b3f090437b0")
!665 = !{!666, !685, !686}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !664, file: !2, baseType: !667, size: 64, align: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut bindings::bindings_raw::key, *const bindings::bindings_raw::key_type, *const bindings::bindings_raw::key_payload, *mut bindings::bindings_raw::key) -> i32>", scope: !153, file: !2, size: 64, align: 64, elements: !668, templateParams: !15, identifier: "a9eac461f0ceaaf63f17f77116a86400")
!668 = !{!669}
!669 = !DICompositeType(tag: DW_TAG_variant_part, scope: !667, file: !2, size: 64, align: 64, elements: !670, templateParams: !15, identifier: "42e04fe4a238f516cee358d1b454af8d", discriminator: !684)
!670 = !{!671, !680}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !669, file: !2, baseType: !672, size: 64, align: 64, extraData: i64 0)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !667, file: !2, size: 64, align: 64, elements: !15, templateParams: !673, identifier: "752e42fb221344c2c7bd087422c7d12c")
!673 = !{!674}
!674 = !DITemplateTypeParameter(name: "T", type: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut bindings::bindings_raw::key, *const bindings::bindings_raw::key_type, *const bindings::bindings_raw::key_payload, *mut bindings::bindings_raw::key) -> i32", baseType: !676, size: 64, align: 64, dwarfAddressSpace: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{!253, !508, !678, !679, !508}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bindings::bindings_raw::key_type", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bindings::bindings_raw::key_payload", baseType: !639, size: 64, align: 64, dwarfAddressSpace: 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !669, file: !2, baseType: !681, size: 64, align: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !667, file: !2, size: 64, align: 64, elements: !682, templateParams: !673, identifier: "7d4ef1e47a9d91119f146cee227b6be")
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !681, file: !2, baseType: !675, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, scope: !667, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagArtificial)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !664, file: !2, baseType: !508, size: 64, align: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "keytype", scope: !664, file: !2, baseType: !589, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "process_keyring", scope: !480, file: !2, baseType: !508, size: 64, align: 64, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "thread_keyring", scope: !480, file: !2, baseType: !508, size: 64, align: 64, offset: 832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "request_key_auth", scope: !480, file: !2, baseType: !508, size: 64, align: 64, offset: 896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !480, file: !2, baseType: !691, size: 64, align: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::user_struct", baseType: !692, size: 64, align: 64, dwarfAddressSpace: 0)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_struct", scope: !196, file: !2, size: 1088, align: 64, elements: !693, templateParams: !15, identifier: "57840ede6e8a83b49d88fc5d04f11f88")
!693 = !{!694, !695, !703, !704, !705, !706, !707, !708}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !692, file: !2, baseType: !512, size: 32, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_watches", scope: !692, file: !2, baseType: !696, size: 320, align: 64, offset: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "percpu_counter", scope: !196, file: !2, size: 320, align: 64, elements: !697, templateParams: !15, identifier: "66340979f1ac94684b563316f4e377a1")
!697 = !{!698, !699, !700, !701}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !696, file: !2, baseType: !543, size: 32, align: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !696, file: !2, baseType: !536, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !696, file: !2, baseType: !463, size: 128, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !696, file: !2, baseType: !702, size: 64, align: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !253, size: 64, align: 64, dwarfAddressSpace: 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "unix_inflight", scope: !692, file: !2, baseType: !25, size: 64, align: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_bufs", scope: !692, file: !2, baseType: !533, size: 64, align: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "uidhash_node", scope: !692, file: !2, baseType: !372, size: 128, align: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !692, file: !2, baseType: !484, size: 32, align: 32, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !692, file: !2, baseType: !533, size: 64, align: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ratelimit", scope: !692, file: !2, baseType: !709, size: 320, align: 64, offset: 768)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "ratelimit_state", scope: !196, file: !2, size: 320, align: 64, elements: !710, templateParams: !15, identifier: "2b7399ffb9488af6a9d59b6353d9d737")
!710 = !{!711, !712, !713, !714, !715, !716, !717}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !2, baseType: !543, size: 32, align: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !709, file: !2, baseType: !253, size: 32, align: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "burst", scope: !709, file: !2, baseType: !253, size: 32, align: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !709, file: !2, baseType: !253, size: 32, align: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !709, file: !2, baseType: !253, size: 32, align: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !709, file: !2, baseType: !25, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !709, file: !2, baseType: !25, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !480, file: !2, baseType: !719, size: 64, align: 64, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::user_namespace", baseType: !720, size: 64, align: 64, dwarfAddressSpace: 0)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", scope: !196, file: !2, size: 4800, align: 64, elements: !721, templateParams: !15, identifier: "16461ef4d06feb9e9f84cb1c886bc990")
!721 = !{!722, !744, !745, !746, !747, !748, !749, !750, !761, !762, !763, !764, !765, !766, !789, !954, !955, !969, !971}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "uid_map", scope: !720, file: !2, baseType: !723, size: 576, align: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_map", scope: !196, file: !2, size: 576, align: 64, elements: !724, templateParams: !15, identifier: "708c6ea82ce7f745ca2f096aa5ff08ce")
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nr_extents", scope: !723, file: !2, baseType: !147, size: 32, align: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !723, file: !2, baseType: !727, size: 512, align: 64, offset: 64)
!727 = !DICompositeType(tag: DW_TAG_union_type, name: "uid_gid_map__bindgen_ty_1", scope: !196, file: !2, size: 512, align: 64, elements: !728, templateParams: !15, identifier: "21fd9796b64a6a135f7bcb05966077c4")
!728 = !{!729, !736, !742}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !727, file: !2, baseType: !730, size: 480, align: 32)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 480, align: 32, elements: !633)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_extent", scope: !196, file: !2, size: 96, align: 32, elements: !732, templateParams: !15, identifier: "f5f76f05ce0c328d31383fad1c0343ea")
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !731, file: !2, baseType: !147, size: 32, align: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lower_first", scope: !731, file: !2, baseType: !147, size: 32, align: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !731, file: !2, baseType: !147, size: 32, align: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !727, file: !2, baseType: !737, size: 128, align: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "uid_gid_map__bindgen_ty_1__bindgen_ty_1", scope: !196, file: !2, size: 128, align: 64, elements: !738, templateParams: !15, identifier: "7dd836c2b648dabf55d01df90d8fdffd")
!738 = !{!739, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !737, file: !2, baseType: !740, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::uid_gid_extent", baseType: !731, size: 64, align: 64, dwarfAddressSpace: 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !737, file: !2, baseType: !740, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_bindgen_union_align", scope: !727, file: !2, baseType: !743, size: 512, align: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 64, elements: !259)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gid_map", scope: !720, file: !2, baseType: !723, size: 576, align: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "projid_map", scope: !720, file: !2, baseType: !723, size: 576, align: 64, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !720, file: !2, baseType: !719, size: 64, align: 64, offset: 1728)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !720, file: !2, baseType: !253, size: 32, align: 32, offset: 1792)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !720, file: !2, baseType: !484, size: 32, align: 32, offset: 1824)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !720, file: !2, baseType: !488, size: 32, align: 32, offset: 1856)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !720, file: !2, baseType: !751, size: 192, align: 64, offset: 1920)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "ns_common", scope: !196, file: !2, size: 192, align: 64, elements: !752, templateParams: !15, identifier: "db0b1fb0db4a652b7f7b1b06bc5c1239")
!752 = !{!753, !754, !759, !760}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stashed", scope: !751, file: !2, baseType: !533, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !751, file: !2, baseType: !755, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bindings::bindings_raw::proc_ns_operations", baseType: !756, size: 64, align: 64, dwarfAddressSpace: 0)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_ns_operations", scope: !196, file: !2, align: 8, elements: !757, templateParams: !15, identifier: "212819e8926beffe19960b69d566b073")
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !756, file: !2, baseType: !460, align: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !751, file: !2, baseType: !147, size: 32, align: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !751, file: !2, baseType: !512, size: 32, align: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !2, baseType: !25, size: 64, align: 64, offset: 2112)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "parent_could_setfcap", scope: !720, file: !2, baseType: !361, size: 8, align: 8, offset: 2176)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "keyring_name_list", scope: !720, file: !2, baseType: !463, size: 128, align: 64, offset: 2240)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "user_keyring_register", scope: !720, file: !2, baseType: !508, size: 64, align: 64, offset: 2368)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "keyring_sem", scope: !720, file: !2, baseType: !530, size: 320, align: 64, offset: 2432)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !720, file: !2, baseType: !767, size: 256, align: 64, offset: 2752)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", scope: !196, file: !2, size: 256, align: 64, elements: !768, templateParams: !15, identifier: "16f73b875cf091b73e13fca31b14385e")
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !2, baseType: !533, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !767, file: !2, baseType: !463, size: 128, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !767, file: !2, baseType: !772, size: 64, align: 64, offset: 192)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut bindings::bindings_raw::work_struct)>", scope: !153, file: !2, size: 64, align: 64, elements: !773, templateParams: !15, identifier: "6445432b47c4858031351a2c9f316d71")
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_variant_part, scope: !772, file: !2, size: 64, align: 64, elements: !775, templateParams: !15, identifier: "3c5e46eef346526eb6f5e7a0d93bd8b5", discriminator: !788)
!775 = !{!776, !784}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !774, file: !2, baseType: !777, size: 64, align: 64, extraData: i64 0)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !772, file: !2, size: 64, align: 64, elements: !15, templateParams: !778, identifier: "2db61551e95ee07ce85905a5436b107b")
!778 = !{!779}
!779 = !DITemplateTypeParameter(name: "T", type: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut bindings::bindings_raw::work_struct)", baseType: !781, size: 64, align: 64, dwarfAddressSpace: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::work_struct", baseType: !767, size: 64, align: 64, dwarfAddressSpace: 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !774, file: !2, baseType: !785, size: 64, align: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !772, file: !2, size: 64, align: 64, elements: !786, templateParams: !778, identifier: "95d7a77b19523f2dc4bd1eaf49fac312")
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !785, file: !2, baseType: !780, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, scope: !772, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagArtificial)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !720, file: !2, baseType: !790, size: 768, align: 64, offset: 3008)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_set", scope: !196, file: !2, size: 768, align: 64, elements: !791, templateParams: !15, identifier: "9ccc0e0f8f3f208e22a4cac4427fd82b")
!791 = !{!792, !810}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "is_seen", scope: !790, file: !2, baseType: !793, size: 64, align: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut bindings::bindings_raw::ctl_table_set) -> i32>", scope: !153, file: !2, size: 64, align: 64, elements: !794, templateParams: !15, identifier: "b9155725e09104e550fa7958d4e3dc36")
!794 = !{!795}
!795 = !DICompositeType(tag: DW_TAG_variant_part, scope: !793, file: !2, size: 64, align: 64, elements: !796, templateParams: !15, identifier: "f8358e879aa16c0be8d6025e30e067e", discriminator: !809)
!796 = !{!797, !805}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !795, file: !2, baseType: !798, size: 64, align: 64, extraData: i64 0)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !793, file: !2, size: 64, align: 64, elements: !15, templateParams: !799, identifier: "b0d2dbe0b3e61bd5d863560f9a142bba")
!799 = !{!800}
!800 = !DITemplateTypeParameter(name: "T", type: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut bindings::bindings_raw::ctl_table_set) -> i32", baseType: !802, size: 64, align: 64, dwarfAddressSpace: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!253, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ctl_table_set", baseType: !790, size: 64, align: 64, dwarfAddressSpace: 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !795, file: !2, baseType: !806, size: 64, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !793, file: !2, size: 64, align: 64, elements: !807, templateParams: !799, identifier: "8749686793bd4dfbf2f8a77b19b0e428")
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !806, file: !2, baseType: !801, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, scope: !793, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagArtificial)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !790, file: !2, baseType: !811, size: 704, align: 64, offset: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_dir", scope: !196, file: !2, size: 704, align: 64, elements: !812, templateParams: !15, identifier: "7387fdbf841e071b40852c932670cc7e")
!812 = !{!813, !950}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !811, file: !2, baseType: !814, size: 640, align: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_header", scope: !196, file: !2, size: 640, align: 64, elements: !815, templateParams: !15, identifier: "4aed9cea5bcbe18cde8d4a94441be985")
!815 = !{!816, !867, !877, !878, !937, !938, !940, !946}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !814, file: !2, baseType: !817, size: 192, align: 64)
!817 = !DICompositeType(tag: DW_TAG_union_type, name: "ctl_table_header__bindgen_ty_1", scope: !196, file: !2, size: 192, align: 64, elements: !818, templateParams: !15, identifier: "6007ac5c282a019f91192e3483be391")
!818 = !{!819, !865, !866}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__bindgen_anon_1", scope: !817, file: !2, baseType: !820, size: 192, align: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_header__bindgen_ty_1__bindgen_ty_1", scope: !196, file: !2, size: 192, align: 64, elements: !821, templateParams: !15, identifier: "f7a4f868151f01542ab5fc9e2f1d25a6")
!821 = !{!822, !862, !863, !864}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table", scope: !820, file: !2, baseType: !823, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ctl_table", baseType: !824, size: 64, align: 64, dwarfAddressSpace: 0)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table", scope: !196, file: !2, size: 512, align: 64, elements: !825, templateParams: !15, identifier: "7b2aefeb75a077be5f5fdbccf6a8b55")
!825 = !{!826, !827, !828, !829, !830, !831, !850, !860, !861}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "procname", scope: !824, file: !2, baseType: !622, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !2, baseType: !387, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !824, file: !2, baseType: !253, size: 32, align: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !824, file: !2, baseType: !142, size: 16, align: 16, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !824, file: !2, baseType: !823, size: 64, align: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "proc_handler", scope: !824, file: !2, baseType: !832, size: 64, align: 64, offset: 256)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut bindings::bindings_raw::ctl_table, i32, *mut core::ffi::c_void, *mut usize, *mut i64) -> i32>", scope: !153, file: !2, size: 64, align: 64, elements: !833, templateParams: !15, identifier: "a716eed21e64d4542a6aaf062289790b")
!833 = !{!834}
!834 = !DICompositeType(tag: DW_TAG_variant_part, scope: !832, file: !2, size: 64, align: 64, elements: !835, templateParams: !15, identifier: "e206a85617ca7dd3234388ff600f06ea", discriminator: !849)
!835 = !{!836, !845}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !834, file: !2, baseType: !837, size: 64, align: 64, extraData: i64 0)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !832, file: !2, size: 64, align: 64, elements: !15, templateParams: !838, identifier: "7029b3a0d5339cf9a095454254a3f815")
!838 = !{!839}
!839 = !DITemplateTypeParameter(name: "T", type: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut bindings::bindings_raw::ctl_table, i32, *mut core::ffi::c_void, *mut usize, *mut i64) -> i32", baseType: !841, size: 64, align: 64, dwarfAddressSpace: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!253, !823, !253, !387, !843, !844}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i64", baseType: !536, size: 64, align: 64, dwarfAddressSpace: 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !834, file: !2, baseType: !846, size: 64, align: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !832, file: !2, size: 64, align: 64, elements: !847, templateParams: !838, identifier: "b1b3aea27adcfb6cd7175af18470cb18")
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !846, file: !2, baseType: !840, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, scope: !832, file: !2, baseType: !25, size: 64, align: 64, flags: DIFlagArtificial)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !824, file: !2, baseType: !851, size: 64, align: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bindings::bindings_raw::ctl_table_poll", baseType: !852, size: 64, align: 64, dwarfAddressSpace: 0)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_poll", scope: !196, file: !2, size: 256, align: 64, elements: !853, templateParams: !15, identifier: "1dbf4d2548d349ca3e9bb49e2ce2f1af")
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !852, file: !2, baseType: !414, size: 32, align: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !852, file: !2, baseType: !856, size: 192, align: 64, offset: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", scope: !196, file: !2, size: 192, align: 64, elements: !857, templateParams: !15, identifier: "2e5d2c96ee49db3a31d4fcd1236f568")
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !856, file: !2, baseType: !382, size: 32, align: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !856, file: !2, baseType: !463, size: 128, align: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "extra1", scope: !824, file: !2, baseType: !387, size: 64, align: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "extra2", scope: !824, file: !2, baseType: !387, size: 64, align: 64, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !820, file: !2, baseType: !253, size: 32, align: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !820, file: !2, baseType: !253, size: 32, align: 32, offset: 96)
